micropython/micropython/ports/stm32/uart.c
// this IRQ handler is set up to handle RXNE interrupts only
void uart_irq_handler(mp_uint_t uart_id) {
    // get the uart object
    pyb_uart_obj_t *self = MP_STATE_PORT(pyb_uart_obj_all)[uart_id - 1];

    if (self == NULL) {
        // UART object has not been set, so we can't do anything, not
        // even disable the IRQ.  This should never happen.
        return;
    }

    self->mpirq.flags = 0;
    if (__HAL_UART_GET_FLAG(&self->uart, UART_FLAG_RXNE) != RESET) {
        if (self->read_buf_len != 0) {
            uint16_t next_head = (self->read_buf_head + 1) % self->read_buf_len;
            if (next_head != self->read_buf_tail) {
                // only read data if room in buf
                #if defined(STM32F0) || defined(STM32F7) || defined(STM32L4) || defined(STM32H7)
                int data = self->uart.Instance->RDR; // clears UART_FLAG_RXNE
                #else
                int data = self->uart.Instance->DR; // clears UART_FLAG_RXNE
                #endif
                data &= self->char_mask;
                // Handle interrupt coming in on a UART REPL
                if (self->attached_to_repl && data == mp_interrupt_char) {
                    pendsv_kbd_intr();
                    return;
                }
                if (self->char_width == CHAR_WIDTH_9BIT) {
                    ((uint16_t*)self->read_buf)[self->read_buf_head] = data;
                } else {
                    self->read_buf[self->read_buf_head] = data;
                }
                self->read_buf_head = next_head;
            } else { // No room: leave char in buf, disable interrupt
                __HAL_UART_DISABLE_IT(&self->uart, UART_IT_RXNE);
            }
        }
    }
    /*
     * Add here handling of MP handled IRQ
     */
    if (__HAL_UART_GET_FLAG(&self->uart, UART_FLAG_IDLE) != RESET) {
        __HAL_UART_CLEAR_IDLEFLAG(&self->uart);
        self->mpirq.flags |= UART_FLAG_IDLE;
    }

    // check the flags to see if the user handler should be called
    if (self->mpirq.trigger & self->mpirq.flags) {
        // call the MP defined handler
        mp_irq_handler(mp_irq_find(self));
    }
}

STATIC mp_obj_t uart_irq_new(pyb_uart_obj_t *self, mp_obj_t handler, mp_int_t trigger, bool hard) {
    // disable the uart interrupts before updating anything
    uart_irq_disable(self);
    self->mpirq.trigger = 0;

    // create the callback
    mp_obj_t _irq = mp_irq_new((mp_obj_t)self, handler, hard, &uart_irq_methods);

    if (_irq != mp_const_none)
    {
        uart_irq_trigger(self, trigger);
    }
    return _irq;
}

STATIC mp_uint_t uart_irq_trigger(mp_obj_t self_in, mp_uint_t new_trigger) {
    pyb_uart_obj_t *self = MP_OBJ_TO_PTR(self_in);
    uart_irq_disable(self_in);
    self->mpirq.trigger = new_trigger;
    if (new_trigger != 0)
    {
        uart_irq_enable(self_in);
    }
    return 0;
}

STATIC void uart_irq_enable(mp_obj_t self_in) {
    pyb_uart_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (self->mpirq.trigger) {
        for (uint8_t entry=0;entry<IRQ_CNT;entry++) {
            if (irq_not_touch&mp_irq_map[entry].flag) {
                continue;
            }
            if (mp_irq_map[entry].flag&self->mpirq.trigger) {
                __HAL_UART_ENABLE_IT(&self->uart, mp_irq_map[entry].irq_en);
            }
        }
    }
}

STATIC void uart_irq_disable(mp_obj_t self_in) {
    pyb_uart_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (self->mpirq.trigger) {
        for (uint8_t entry=0;entry<IRQ_CNT;entry++) {
            if (irq_not_touch&mp_irq_map[entry].flag) {
                continue;
            }
            if (mp_irq_map[entry].flag&self->mpirq.trigger) {
                __HAL_UART_DISABLE_IT(&self->uart, mp_irq_map[entry].irq_en);
            }
        }
    }
}

STATIC mp_uint_t uart_irq_info(mp_obj_t self_in, mp_uint_t info_type) {
    pyb_uart_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (IRQ_INFO_FLAGS == info_type)
    {
        return self->mpirq.flags;
    } else if (IRQ_INFO_TRIGGERS == info_type) {
        return self->mpirq.trigger;
    }
    return 0;
}

/******************************************************************************/
/* MicroPython bindings                                                       */

STATIC void pyb_uart_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    pyb_uart_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (!self->is_enabled) {
        mp_printf(print, "UART(%u)", self->uart_id);
    } else {
        mp_int_t bits;
        switch (self->uart.Init.WordLength) {
            #ifdef UART_WORDLENGTH_7B
            case UART_WORDLENGTH_7B: bits = 7; break;
            #endif
            case UART_WORDLENGTH_8B: bits = 8; break;
            case UART_WORDLENGTH_9B: default: bits = 9; break;
        }
        if (self->uart.Init.Parity != UART_PARITY_NONE) {
            bits -= 1;
        }
        mp_printf(print, "UART(%u, baudrate=%u, bits=%u, parity=",
            self->uart_id, self->uart.Init.BaudRate, bits);
        if (self->uart.Init.Parity == UART_PARITY_NONE) {
            mp_print_str(print, "None");
        } else if (self->uart.Init.Parity == UART_PARITY_EVEN) {
            mp_print_str(print, "0");
        } else {
            mp_print_str(print, "1");
        }
        mp_printf(print, ", stop=%u, flow=",
            self->uart.Init.StopBits == UART_STOPBITS_1 ? 1 : 2);
        if (self->uart.Init.HwFlowCtl == UART_HWCONTROL_NONE) {
            mp_print_str(print, "0");
        } else {
            if (self->uart.Init.HwFlowCtl & UART_HWCONTROL_RTS) {
                mp_print_str(print, "RTS");
                if (self->uart.Init.HwFlowCtl & UART_HWCONTROL_CTS) {
                   mp_print_str(print, "|");
                }
            }
            if (self->uart.Init.HwFlowCtl & UART_HWCONTROL_CTS) {
                mp_print_str(print, "CTS");
            }
        }
        mp_printf(print, ", timeout=%u, timeout_char=%u, rxbuf=%u)",
            self->timeout, self->timeout_char,
            self->read_buf_len == 0 ? 0 : self->read_buf_len - 1); // -1 to adjust for usable length of buffer
        if (self->mpirq.trigger!=0) {
            mp_printf(print, " Callback on IRQ(s): 0x%08x",self->mpirq.trigger);
        }
    }
}

/// \method init(baudrate, bits=8, parity=None, stop=1, *, timeout=1000, timeout_char=0, flow=0, read_buf_len=64)
///
/// Initialise the UART bus with the given parameters:
///
///   - `baudrate` is the clock rate.
///   - `bits` is the number of bits per byte, 7, 8 or 9.
///   - `parity` is the parity, `None`, 0 (even) or 1 (odd).
///   - `stop` is the number of stop bits, 1 or 2.
///   - `timeout` is the timeout in milliseconds to wait for the first character.
///   - `timeout_char` is the timeout in milliseconds to wait between characters.
///   - `flow` is RTS | CTS where RTS == 256, CTS == 512
///   - `read_buf_len` is the character length of the read buffer (0 to disable).
STATIC mp_obj_t pyb_uart_init_helper(pyb_uart_obj_t *self, size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_baudrate, MP_ARG_REQUIRED | MP_ARG_INT, {.u_int = 9600} },
        { MP_QSTR_bits, MP_ARG_INT, {.u_int = 8} },
        { MP_QSTR_parity, MP_ARG_OBJ, {.u_rom_obj = MP_ROM_PTR(&mp_const_none_obj)} },
        { MP_QSTR_stop, MP_ARG_INT, {.u_int = 1} },
        { MP_QSTR_flow, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = UART_HWCONTROL_NONE} },
        { MP_QSTR_timeout, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 1000} },
        { MP_QSTR_timeout_char, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0} },
        { MP_QSTR_rxbuf, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_read_buf_len, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 64} }, // legacy
    };

    // parse args
    struct {
        mp_arg_val_t baudrate, bits, parity, stop, flow, timeout, timeout_char, rxbuf, read_buf_len;
    } args;
    mp_arg_parse_all(n_args, pos_args, kw_args,
        MP_ARRAY_SIZE(allowed_args), allowed_args, (mp_arg_val_t*)&args);

    // set the UART configuration values
    memset(&self->uart, 0, sizeof(self->uart));
    UART_InitTypeDef *init = &self->uart.Init;

    // baudrate
    init->BaudRate = args.baudrate.u_int;

